Repository: mafatorcz/wordpress-user-security-enhancements
Catalog: languages/bezpecnostni-upravy-usera-*.po
Languages: cs_cz, de_de, hr_hr, pl_pl, sk_sk, sl_si

source: Password must be at least %d characters.
cs_cz: Heslo musi mit alespon %d znaku.
de_de: Das Passwort muss mindestens %d Zeichen lang sein.
hr_hr: Lozinka mora imati najmanje %d znakova.
pl_pl: Haslo musi miec co najmniej %d znakow.
sk_sk: Heslo musi mat aspon %d znakov.
sl_si: Geslo mora imeti vsaj %d znakov.

source: Force password change
cs_cz: Vynuceni zmeny hesla
de_de: Passwortaenderung erzwingen
hr_hr: Prisili promjenu lozinke
pl_pl: Wymuszenie zmiany hasla
sk_sk: Vynutenie zmeny hesla
sl_si: Prisili menjavo gesla

source: Click the button to force all users to change their password again.
cs_cz: Stisknutim tlacitka vynutite zmenu hesla pro vsechny uzivatele znovu.
de_de: Klicken Sie auf die Schaltflaeche, um alle Benutzer erneut zur Passwortaenderung zu zwingen.
hr_hr: Kliknite gumb kako biste ponovno prisilili sve korisnike na promjenu lozinke.
pl_pl: Kliknij przycisk, aby ponownie wymusic zmiane hasla u wszystkich uzytkownikow.
sk_sk: Stlacenim tlacidla vynutite zmenu hesla pre vsetkych pouzivatelov znova.
sl_si: Kliknite gumb, da ponovno prisilite vse uporabnike k spremembi gesla.

source: Force password change again
cs_cz: Vynutit zmenu hesla znovu
de_de: Passwortaenderung erneut erzwingen
hr_hr: Ponovno prisili promjenu lozinke
pl_pl: Wymus zmiane hasla ponownie
sk_sk: Vynutit zmenu hesla znova
sl_si: Ponovno prisili menjavo gesla

source: Insufficient permissions.
cs_cz: Nedostatecna opravneni.
de_de: Unzureichende Berechtigungen.
hr_hr: Nedovoljna ovlastenja.
pl_pl: Niewystarczajace uprawnienia.
sk_sk: Nedostatocne opravnenia.
sl_si: Nezadostna dovoljenja.

source: Password must include at least one uppercase letter.
cs_cz: Heslo musi obsahovat alespon jedno velke pismeno.
de_de: Das Passwort muss mindestens einen Grossbuchstaben enthalten.
hr_hr: Lozinka mora sadrzavati barem jedno veliko slovo.
pl_pl: Haslo musi zawierac co najmniej jedna wielka litere.
sk_sk: Heslo musi obsahovat aspon jedno velke pismeno.
sl_si: Geslo mora vsebovati vsaj eno veliko crko.

source: Password must include at least one number.
cs_cz: Heslo musi obsahovat alespon jednu cislici.
de_de: Das Passwort muss mindestens eine Zahl enthalten.
hr_hr: Lozinka mora sadrzavati barem jednu znamenku.
pl_pl: Haslo musi zawierac co najmniej jedna cyfre.
sk_sk: Heslo musi obsahovat aspon jednu cislicu.
sl_si: Geslo mora vsebovati vsaj eno stevilko.

source: Password must include at least one special character.
cs_cz: Heslo musi obsahovat alespon jeden specialni znak.
de_de: Das Passwort muss mindestens ein Sonderzeichen enthalten.
hr_hr: Lozinka mora sadrzavati barem jedan poseban znak.
pl_pl: Haslo musi zawierac co najmniej jeden znak specjalny.
sk_sk: Heslo musi obsahovat aspon jeden specialny znak.
sl_si: Geslo mora vsebovati vsaj en poseben znak.

source: Minimum length: 22 characters
cs_cz: Minimalni delka: 22 znaku
de_de: Minimale Laenge: 22 Zeichen
hr_hr: Minimalna duljina: 22 znaka
pl_pl: Minimalna dlugosc: 22 znaki
sk_sk: Minimalna dlzka: 22 znakov
sl_si: Minimalna dolzina: 22 znakov

source: At least one uppercase letter
cs_cz: Alespon jedno velke pismeno
de_de: Mindestens ein Grossbuchstabe
hr_hr: Barem jedno veliko slovo
pl_pl: Co najmniej jedna wielka litera
sk_sk: Aspon jedno velke pismeno
sl_si: Vsaj ena velika crka

source: At least one number
cs_cz: Alespon jedna cislice
de_de: Mindestens eine Zahl
hr_hr: Barem jedna znamenka
pl_pl: Co najmniej jedna cyfra
sk_sk: Aspon jedna cislica
sl_si: Vsaj ena stevilka

source: At least one special character
cs_cz: Alespon jeden specialni znak
de_de: Mindestens ein Sonderzeichen
hr_hr: Barem jedan poseban znak
pl_pl: Co najmniej jeden znak specjalny
sk_sk: Aspon jeden specialny znak
sl_si: Vsaj en poseben znak

source: Save the password using the Update Profile button at the bottom.
cs_cz: Heslo ulozte tlacitkem Aktualizovat profil uplne dole.
de_de: Speichern Sie das Passwort mit der Schaltflaeche Profil aktualisieren ganz unten.
hr_hr: Spremite lozinku gumbom Azuriraj profil na dnu.
pl_pl: Zapisz haslo przyciskiem Aktualizuj profil na dole.
sk_sk: Heslo ulozte tlacidlom Aktualizovat profil uplne dole.
sl_si: Geslo shranite z gumbom Posodobi profil na dnu.

source: Go to password fields
cs_cz: Prejit na pole s heslem
de_de: Zu den Passwortfeldern springen
hr_hr: Idi na polja lozinke
pl_pl: Przejdz do pol hasla
sk_sk: Prejst na polia pre heslo
sl_si: Pojdi na polja gesla

source: Continue
cs_cz: Pokracovat
de_de: Weiter
hr_hr: Nastavi
pl_pl: Kontynuuj
sk_sk: Pokracovat
sl_si: Nadaljuj

source: Hint: Password must be at least 22 characters long and include an uppercase letter, a number, and a special character.
cs_cz: Napoveda: Heslo musi mit alespon 22 znaku a obsahovat velke pismeno, cislici a specialni znak.
de_de: Hinweis: Das Passwort muss mindestens 22 Zeichen lang sein und einen Grossbuchstaben, eine Zahl und ein Sonderzeichen enthalten.
hr_hr: Napomena: Lozinka mora imati najmanje 22 znaka i sadrzavati veliko slovo, znamenku i poseban znak.
pl_pl: Wskazowka: Haslo musi miec co najmniej 22 znaki i zawierac wielka litere, cyfre oraz znak specjalny.
sk_sk: Napoveda: Heslo musi mat aspon 22 znakov a obsahovat velke pismeno, cislicu a specialny znak.
sl_si: Namig: Geslo mora imeti vsaj 22 znakov in vsebovati veliko crko, stevilko in poseben znak.

source: Repeat the same password to confirm.
cs_cz: Zopakujte stejne heslo pro potvrzeni.
de_de: Bitte dasselbe Passwort zur Bestaetigung wiederholen.
hr_hr: Ponovite istu lozinku za potvrdu.
pl_pl: Powtorz to samo haslo w celu potwierdzenia.
sk_sk: Zopakujte rovnake heslo pre potvrdenie.
sl_si: Ponovite isto geslo za potrditev.

source: Recommendation: use a long passphrase. You can verify it with the Show password button.
cs_cz: Doporuceni: pouzijte dlouhou passphrase. Pro kontrolu lze pouzit tlacitko Zobrazit heslo.
de_de: Empfehlung: Verwenden Sie eine lange Passphrase. Zur Kontrolle koennen Sie die Schaltflaeche Passwort anzeigen nutzen.
hr_hr: Preporuka: koristite dugu passphrase. Za provjeru mozete koristiti gumb Prikazi lozinku.
pl_pl: Zalecenie: uzyj dlugiej passphrase. Do kontroli mozna uzyc przycisku Pokaz haslo.
sk_sk: Doporucenie: pouzite dlhu passphrase. Pre kontrolu mozno pouzit tlacidlo Zobrazit heslo.
sl_si: Priporocilo: uporabite dolgo passphrase. Za preverjanje lahko uporabite gumb Prikazi geslo.

source: Password length: %1$d / %2$d (uppercase letter, number, special character)
cs_cz: Delka hesla: %1$d / %2$d (velke pismeno, cislice, specialni znak)
de_de: Passwortlaenge: %1$d / %2$d (Grossbuchstabe, Zahl, Sonderzeichen)
hr_hr: Duljina lozinke: %1$d / %2$d (veliko slovo, znamenka, poseban znak)
pl_pl: Dlugosc hasla: %1$d / %2$d (wielka litera, cyfra, znak specjalny)
sk_sk: Dlzka hesla: %1$d / %2$d (velke pismeno, cislica, specialny znak)
sl_si: Dolzina gesla: %1$d / %2$d (velika crka, stevilka, poseben znak)

source: Password change required
cs_cz: Zmena hesla je povinna
de_de: Passwortaenderung ist erforderlich
hr_hr: Promjena lozinke je obavezna
pl_pl: Zmiana hasla jest wymagana
sk_sk: Zmena hesla je povinna
sl_si: Menjava gesla je obvezna

source: For security reasons, please change your password. Minimum length is 22 characters.
cs_cz: Z bezpecnostnich duvodu si prosim zmente heslo. Minimalni delka je 22 znaku.
de_de: Bitte aendern Sie aus Sicherheitsgruenden Ihr Passwort. Die Mindestlaenge betraegt 22 Zeichen.
hr_hr: Iz sigurnosnih razloga promijenite lozinku. Minimalna duljina je 22 znaka.
pl_pl: Ze wzgledow bezpieczenstwa prosze zmienic haslo. Minimalna dlugosc to 22 znaki.
sk_sk: Z bezpecnostnych dovodov si prosim zmente heslo. Minimalna dlzka je 22 znakov.
sl_si: Zaradi varnosti prosim spremenite geslo. Minimalna dolzina je 22 znakov.
